XML/Public/CMSQ01/request_pre/2022年3月1日/body_CMSQ01_request_pre_20220301203723.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:out="http://outsystem.ats.com.cn">
   <soapenv:Header/>
   <soapenv:Body>
      <out:outSystemWS>
         <out:in0><![CDATA[<MBS>
        <pub>
            <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
            <SRCBATCHNO>S2020061801</SRCBATCHNO>
            <TRANSCODE>CMSQ01</TRANSCODE>
            <TRANSDATETIME>2020-06-18 17:20:10</TRANSDATETIME>
            <MD5>123456</MD5>
        </pub>
    <req>
        <list>
            <detail>
                <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
                <ORGCODE>001000</ORGCODE>
                <CODE>s011</CODE>
                <NAME>喜茶111</NAME>
                <CATEGORYCODE>GYS</CATEGORYCODE>
                <ISACTIVE>1</ISACTIVE>
                <RECONCILIATIONACCOUNT>喜茶</RECONCILIATIONACCOUNT>
                <accounts>
                <accountdetail>
                <ACCOUNTNUMBER>6332423654</ACCOUNTNUMBER>
                <ACCOUNTNAME>喜茶</ACCOUNTNAME>
                <CURRENCYCODE>CNY</CURRENCYCODE>
                <PRIVATEFLAG>1</PRIVATEFLAG>
                <CNAPS>402821006102</CNAPS>
                <ISACTIVE>1</ISACTIVE>
                </accountdetail>
                </accounts>
                </detail>
                <detail>
                <SRCOUTSYSTEMCODE>OA</SRCOUTSYSTEMCODE>
                <ORGCODE>001000</ORGCODE>
                <CODE>s02</CODE>
                <NAME>交投</NAME>
                <CATEGORYCODE>GYS</CATEGORYCODE>
                <ISACTIVE>1</ISACTIVE>
                <RECONCILIATIONACCOUNT>交投</RECONCILIATIONACCOUNT>
                <accounts>
                <accountdetail>
                <ACCOUNTNUMBER>688745354</ACCOUNTNUMBER>
                <ACCOUNTNAME>交投</ACCOUNTNAME>
                <CURRENCYCODE>CNY</CURRENCYCODE>
                <PRIVATEFLAG>1</PRIVATEFLAG>
                <CNAPS>402821006102</CNAPS>
                <ISACTIVE>1</ISACTIVE>
                <ELEDRAFITS>1</ELEDRAFITS>
                </accountdetail>
                </accounts>
                </detail>
        </list>
    </req>
    </MBS>
    ]]>
    </out:in0>
      </out:outSystemWS>
   </soapenv:Body>
</soapenv:Envelope>